# MacroLanguageType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModule..::..MacroLanguageType Property
MacroModule Class See Also
---
The Macro language type.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroLanguageType MacroLanguageType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MacroLanguageType As MacroLanguageType
	Get
```

Visual C++
---
```text
public:
property MacroLanguageType MacroLanguageType {
	MacroLanguageType get ();
}
```

# See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace